src/InformationRegisters/БЗ_НастройкиБазыЗнаний/БЗ_НастройкиБазыЗнаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БЗ_НастройкиБазыЗнаний</name>
  <resources>
    <name>ЗначениеСсылка</name>
    <type>
      <types>CatalogRef.БЗ_СтатьиБазыЗнанийПрисоединенныеФайлы</types>
      <types>CatalogRef.БЗ_КомментарииБазыЗнаний</types>
      <types>EnumRef.ТипыХраненияФайлов</types>
      <types>EnumRef.БЗ_ВидыНовостейБазыЗнаний</types>
      <types>CatalogRef.БЗ_ПользователиБазыЗнаний</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.БЗ_КатегорииБазыЗнаний</types>
      <types>CatalogRef.БЗ_КлючевыеСловаБазыЗнаний</types>
      <types>CatalogRef.БЗ_НовостиБазыЗнаний</types>
      <types>EnumRef.СтатусыИзвлеченияТекстаФайлов</types>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.БЗ_СтатьиБазыЗнаний</types>
      <types>CatalogRef.ТомаХраненияФайлов</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеЧисло</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначениеСтрока</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеБулево</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ИмяРесурса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ИмяНастройки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/БЗ_НастройкиБазыЗнаний/ManagerModule.bsl
Функция ПолучитьЗначениеНастройки(знач ИмяНастройки, знач ПользовательСсылка) Экспорт
	
	Если НЕ ТипЗнч(ПользовательСсылка) = Тип("СправочникСсылка.Пользователи") Тогда
		ПользовательСсылка = Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИмяНастройки"	, ИмяНастройки);
	Запрос.УстановитьПараметр("Пользователь"	, ПользовательСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БЗ_НастройкиБазыЗнаний.ИмяНастройки,
	|	БЗ_НастройкиБазыЗнаний.Пользователь,
	|	БЗ_НастройкиБазыЗнаний.ЗначениеСсылка,
	|	БЗ_НастройкиБазыЗнаний.ЗначениеЧисло,
	|	БЗ_НастройкиБазыЗнаний.ЗначениеСтрока,
	|	БЗ_НастройкиБазыЗнаний.ЗначениеБулево,
	|	БЗ_НастройкиБазыЗнаний.ИмяРесурса
	|ИЗ
	|	РегистрСведений.БЗ_НастройкиБазыЗнаний КАК БЗ_НастройкиБазыЗнаний
	|ГДЕ
	|	БЗ_НастройкиБазыЗнаний.ИмяНастройки = &ИмяНастройки
	|	И БЗ_НастройкиБазыЗнаний.Пользователь = &Пользователь";
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка[Выборка.ИмяРесурса];
	
КонецФункции
